### 数据清洗和准备

#### 处理缺失数据

In [3]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan,
'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### 滤除缺失数据

In [9]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna() # 就像把na丢掉

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [8]:
cleaned = data.dropna()

NameError: name 'data' is not defined

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all') # how='all' 只会丢弃全是na的行或者列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1,how="all") # 这里的axis=1代表的是列

NameError: name 'data' is not defined

In [4]:
df = pd.DataFrame(np.random.randn(7, 3))

In [11]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

In [22]:
df

          0         1         2
0 -0.561012       NaN       NaN
1 -1.077835       NaN       NaN
2  0.363241       NaN  0.563557
3 -0.438482       NaN  1.042978
4 -0.160595  0.291832  0.009427
5 -0.547714 -1.036331 -2.432956
6 -0.631460 -0.971859 -0.517889

In [12]:
df.dropna()

          0         1         2
4 -0.220449 -0.744849 -0.554345
5  0.333153 -0.074728  2.296203
6  0.255393 -0.240565  1.093795

In [13]:
df.dropna(thresh=2) # thresh从第二行开始

          0         1         2
2  1.208497       NaN  1.631667
3  1.344445       NaN  0.060808
4 -0.220449 -0.744849 -0.554345
5  0.333153 -0.074728  2.296203
6  0.255393 -0.240565  1.093795

#### 填充缺失数据

In [14]:
df.fillna(0)

          0         1         2
0 -0.593679  0.000000  0.000000
1 -0.859946  0.000000  0.000000
2  1.208497  0.000000  1.631667
3  1.344445  0.000000  0.060808
4 -0.220449 -0.744849 -0.554345
5  0.333153 -0.074728  2.296203
6  0.255393 -0.240565  1.093795

In [27]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.561012  0.500000  0.000000
1 -1.077835  0.500000  0.000000
2  0.363241  0.500000  0.563557
3 -0.438482  0.500000  1.042978
4 -0.160595  0.291832  0.009427
5 -0.547714 -1.036331 -2.432956
6 -0.631460 -0.971859 -0.517889

In [15]:
_ = df.fillna(0, inplace=True)

In [16]:
df

          0         1         2
0 -0.593679  0.000000  0.000000
1 -0.859946  0.000000  0.000000
2  1.208497  0.000000  1.631667
3  1.344445  0.000000  0.060808
4 -0.220449 -0.744849 -0.554345
5  0.333153 -0.074728  2.296203
6  0.255393 -0.240565  1.093795

In [17]:
df = pd.DataFrame(np.random.randn(6, 3))

In [18]:
df.iloc[2:, 1] = NA

In [19]:
df.iloc[4:, 2] = NA

In [20]:
df

          0         1         2
0  0.570877  0.387539 -0.601356
1  0.719690 -1.379018  0.768230
2  1.622448       NaN  0.951137
3 -2.388108       NaN -0.822112
4 -0.167800       NaN       NaN
5 -0.669723       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0  0.570877  0.387539 -0.601356
1  0.719690 -1.379018  0.768230
2  1.622448 -1.379018  0.951137
3 -2.388108 -1.379018 -0.822112
4 -0.167800 -1.379018 -0.822112
5 -0.669723 -1.379018 -0.822112

In [22]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.570877  0.387539 -0.601356
1  0.719690 -1.379018  0.768230
2  1.622448 -1.379018  0.951137
3 -2.388108 -1.379018 -0.822112
4 -0.167800       NaN -0.822112
5 -0.669723       NaN -0.822112

In [23]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [25]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [28]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated() 
# duplicated 方法返回一个布尔型 Series
# 表示各行是否是重复行 (前面出现过的行)

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

#### 利用函数或映射进行数据转换

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon',
                              'Pastrami', 'corned beef','Bacon',
                              'pastrami', 'honey ham', 'novalox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,6]})

In [35]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [36]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [37]:
lowercased = data['food'].str.lower()

In [38]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [39]:
data['animal'] = lowercased.map(meat_to_animal)

In [40]:
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    cow
5        Bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8      novalox     6.0    NaN

In [ ]:
data['food'].map(lambda x: meat_to_animal[x.lower()]) # 认真体会

#### 替换值

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [42]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [44]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [45]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

#### 重命名轴索引

In [47]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [48]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [49]:
transform = lambda x: x[:4].upper() # 认真体会一下

In [50]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [51]:
data.index = data.index.map(transform)

In [52]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [53]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [54]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [55]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True) 
#inplace修改的是原数据集，而不是副本

In [56]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### 离散化和面元划分

In [57]:
# 连续数据常常被离散化或拆分为“面元”(bin)
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [58]:
bins = [18, 25, 35, 60, 100]

In [59]:
cats = pd.cut(ages, bins)

In [60]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
cats.codes # 显示原数据的元素处于哪个分类

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [62]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [63]:
pd.value_counts(cats) # 记录处于这个区间的数的个数

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [64]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [65]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged',
'Senior']

In [66]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [69]:
data = np.random.rand(20)
data

array([0.14559162, 0.48525483, 0.38646995, 0.55979785, 0.2040957 ,
       0.39799072, 0.826119  , 0.04233849, 0.78998522, 0.5815533 ,
       0.14896402, 0.54832865, 0.19297392, 0.16485083, 0.57317551,
       0.45988799, 0.94147979, 0.24947401, 0.43259309, 0.99704759])

In [70]:
pd.cut(data, 4, precision=2) # 选项 precision=2，限定小数只有两位

[(0.041, 0.28], (0.28, 0.52], (0.28, 0.52], (0.52, 0.76], (0.041, 0.28], ..., (0.28, 0.52], (0.76, 1.0], (0.041, 0.28], (0.28, 0.52], (0.76, 1.0]]
Length: 20
Categories (4, interval[float64]): [(0.041, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

In [71]:
data = np.random.randn(1000)  # Normally distributed

In [72]:
cats = pd.qcut(data, 4)  # Cut into quartiles

In [73]:
cats

[(0.0495, 0.72], (0.72, 2.565], (0.0495, 0.72], (-3.134, -0.628], (0.0495, 0.72], ..., (-0.628, 0.0495], (-0.628, 0.0495], (0.72, 2.565], (-0.628, 0.0495], (0.72, 2.565]]
Length: 1000
Categories (4, interval[float64]): [(-3.134, -0.628] < (-0.628, 0.0495] < (0.0495, 0.72] < (0.72, 2.565]]

In [74]:
pd.value_counts(cats) # 说明是一种平均分布

(0.72, 2.565]       250
(0.0495, 0.72]      250
(-0.628, 0.0495]    250
(-3.134, -0.628]    250
dtype: int64

In [75]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0495, 1.251], (1.251, 2.565], (0.0495, 1.251], (-1.303, 0.0495], (0.0495, 1.251], ..., (-1.303, 0.0495], (-1.303, 0.0495], (0.0495, 1.251], (-1.303, 0.0495], (0.0495, 1.251]]
Length: 1000
Categories (4, interval[float64]): [(-3.134, -1.303] < (-1.303, 0.0495] < (0.0495, 1.251] < (1.251, 2.565]]

#### 检测和过滤异常值

In [76]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [77]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.029214    -0.002848    -0.082263     0.048584
std       1.000103     1.020387     0.980827     1.017016
min      -3.088222    -3.363445    -3.146211    -3.095321
25%      -0.650644    -0.638303    -0.706122    -0.657729
50%       0.029780     0.004916    -0.100086     0.083257
75%       0.721256     0.664253     0.581121     0.728151
max       2.736443     3.221349     3.969760     3.041592

In [79]:
col = data[2]
col

0      0.293803
1     -0.607940
2     -0.378407
3     -0.714940
4      0.811638
5      0.520995
6     -0.315047
7     -1.744438
8      0.816839
9     -2.037048
10     0.792587
11    -0.337726
12    -2.081546
13    -0.333133
14    -1.117466
15    -0.180570
16     0.342714
17     0.122350
18     0.114488
19    -1.131766
20     0.112179
21    -0.292346
22    -0.214135
23     0.455220
24     0.188993
25    -0.486327
26     0.134775
27     0.212103
28    -0.315070
29    -0.847467
         ...
970   -0.135392
971   -0.882420
972    0.358613
973   -0.404226
974   -0.799607
975    0.579508
976   -0.578435
977    0.078322
978   -0.080084
979   -0.205485
980   -0.605431
981    2.165845
982    0.805860
983   -0.246650
984    1.152844
985    0.535237
986   -1.181187
987    2.140325
988    0.581464
989    0.978868
990    0.938377
991   -0.025318
992    0.300181
993    0.269911
994   -0.547258
995   -0.234522
996   -0.761182
997   -0.136012
998   -0.217304
999   -0.396809
Name: 2, Length: 1000, dtype: float64

In [80]:
col[np.abs(col) > 3]

39     3.227185
60    -3.146211
380   -3.123471
423   -3.085034
439    3.941804
495    3.969760
Name: 2, dtype: float64

In [81]:
data[(np.abs(data) > 3).any(1)] 
# any(1)的作用：选出全部含有“超过 3 或-3 的值”的行

            0         1         2         3
39  -1.278061 -1.041282  3.227185  0.984834
58  -3.088222 -1.110287 -0.418320 -1.223169
60   0.031042 -2.045389 -3.146211  0.428171
380 -1.259420  0.003710 -3.123471  0.810698
423 -0.270307  0.941394 -3.085034 -0.342487
439 -1.229588 -1.127586  3.941804  1.314770
495 -1.079241  0.181972  3.969760 -0.725103
594 -1.032142 -2.017304  1.696221 -3.095321
717 -1.550978 -1.730639 -0.094293  3.041592
765 -0.059182 -3.124969  0.552726 -0.027542
823 -1.108680  3.221349  0.588637  0.523519
869 -2.521142 -3.363445 -1.011685 -0.574774
898 -0.722289 -3.312819  1.210274 -0.439376
972  0.581716  3.086497  0.358613 -0.717090

In [82]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [83]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.029302    -0.002354    -0.084047     0.048638
std       0.999832     1.016971     0.972021     1.016604
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.650644    -0.638303    -0.706122    -0.657729
50%       0.029780     0.004916    -0.100086     0.083257
75%       0.721256     0.664253     0.581121     0.728151
max       2.736443     3.000000     3.000000     3.000000

In [84]:
np.sign(data).head() 
# np.sign() 当数据为正是值为1，数据为负的时候值为-1

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0  1.0  1.0 -1.0

#### 排列和随机采样

In [88]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [89]:
sampler = np.random.permutation(5) # permuting，随机重排序

In [90]:
sampler

array([1, 2, 3, 0, 4])

In [91]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [92]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [93]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [94]:
choices = pd.Series([5, 7, -1, 6, 4])

In [95]:
draws = choices.sample(n=10, replace=True)

In [96]:
draws

2   -1
2   -1
1    7
1    7
1    7
0    5
3    6
1    7
1    7
4    4
dtype: int64

#### 计算指标/哑变量

In [98]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [99]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [100]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [101]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [102]:
mnames = ['movie_id', 'title', 'genres']
# 待续

### 字符串操作

#### 字符串对象方法

In [103]:
val = 'a,b,  guido'

In [104]:
val.split(',')

['a', 'b', '  guido']

In [105]:
pieces = [x.strip() for x in val.split(',')]

In [106]:
pieces

['a', 'b', 'guido']

In [107]:
first, second, third = pieces

In [108]:
first + '::' + second + '::' + third

'a::b::guido'

In [109]:
'::'.join(pieces)

'a::b::guido'

In [110]:
'guido' in val

True

In [111]:
val.index(',') 
# 如果找不到字符串，index 将会引发一个异常(而 不是返回-1)

1

In [112]:
val

'a,b,  guido'

In [113]:
val.find(':') # 没找到就返回-1

-1

In [114]:
val.count(',')

2

In [115]:
val.replace(',', '::')

'a::b::  guido'

In [116]:
val.replace(',', '')

'ab  guido'

#### 正则表达式

In [117]:
# re 模块的函数可以分为三个大类:
# 模式匹配、替换以及拆分

In [118]:
import re

In [119]:
text = "foo    bar\t baz  \tqux"

In [120]:
re.split('\s+', text) 
# 描述一个或多个空白 符的 regex 是\s+: s-space +至少有一个

['foo', 'bar', 'baz', 'qux']

In [121]:
# 正则表达式会先被编译，然后再在 text 上调 用其 split 方法。
# 可以用 re.compile 自己编译 regex 以得到一个可重用的 regex 对象
regex = re.compile('\s+')

In [122]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [123]:
regex.findall(text)

['    ', '\t ', '  \t']

In [124]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [125]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [126]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [127]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [128]:
m = regex.search(text)

In [129]:
m

In [130]:
text[m.start():m.end()]

'dave@google.com'

In [131]:
print(regex.match(text))

None

In [132]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [133]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
# 分组写法

In [134]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [135]:
m = regex.match('wesm@bright.net')

In [136]:
m.groups()

('wesm', 'bright', 'net')

In [137]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [138]:
 print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',
text))
# sub 还能通过诸如\1、\2 之类的特殊符号访问各匹配项中的分组。
# 符号\1 对应 第一个匹配的组，\2 对应第二个匹配的组，以此类推

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

#### pandas 的矢量化字符串函数

In [139]:
data = {'Dave': 'dave@google.com', 'Steve':'steve@gmail.com',
         'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [140]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [141]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [142]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [143]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [144]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [146]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [147]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [148]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [149]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object